{"config": [{"config": {"filters": 32, "activation": "relu", "strides": [1, 1], "dtype": "float32", "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 28, 28, 1], "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "name": "conv2d_1", "use_bias": true, "padding": "valid", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [5, 5], "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_1", "pool_size": [2, 2], "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "rate": 0.2, "trainable": true, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activation": "relu", "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 128, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "name": "dense_1", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "softmax", "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 26, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "name": "dense_2", "activity_regularizer": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.1"}